---
title: DocumentReloadLatestProgressChangedEventArgs
classe: Autodesk.Revit.DB.Events.DocumentReloadLatestProgressChangedEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# DocumentReloadLatestProgressChangedEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsMerging { get; }` | `documentReloadLatestProgressChangedEventArgs.IsMerging` | Boolean |
| `Boolean ReloadLatestFinished { get; }` | `documentReloadLatestProgressChangedEventArgs.ReloadLatestFinished` | Boolean |
| `Int32 RetryTimes { get; }` | `documentReloadLatestProgressChangedEventArgs.RetryTimes` | Int32 |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```